fix: lab1 отображение
